UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Маркетплейсы/рар_мп_Маркетплейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Маркетплейсы</name>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/CommonModules/рар_мп_HTTP_запросы/Module.bsl
Функция HTTPЗапрос(ТекстЗапроса, Аккаунт) Экспорт
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		APIKEY 	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Ozon_ApiKey");
		ClientID = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Ozon_ClientID");
		
		ЗаголовокHTTP = Новый Соответствие();
		ЗаголовокHTTP.Вставить("Content-Type", "application/json");
		ЗаголовокHTTP.Вставить("Api-Key", APIKEY);
		ЗаголовокHTTP.Вставить("Client-Id",	ClientID);	
		
		Запрос = Новый HTTPЗапрос(ТекстЗапроса, ЗаголовокHTTP);
		
		Возврат Запрос;		
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		APIKEY = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "WB_ApiKey");
		
		ЗаголовокHTTP = Новый Соответствие();
		ЗаголовокHTTP.Вставить("Content-Type", 	"application/json");
		ЗаголовокHTTP.Вставить("Authorization",	APIKEY);	
		
		Запрос = Новый HTTPЗапрос(ТекстЗапроса, ЗаголовокHTTP);  
		
		Возврат Запрос;	
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		APIKEY = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "ЯМ_ApiKey");
		
		ЗаголовокHTTP = Новый Соответствие();
		ЗаголовокHTTP.Вставить("Content-Type", "application/json");
		ЗаголовокHTTP.Вставить("Api-Key", APIKEY);	
		
		Запрос = Новый HTTPЗапрос(ТекстЗапроса, ЗаголовокHTTP);  
		
		Возврат Запрос;	
		
	КонецЕсли;
	
КонецФункции

Функция НовоеHTTPСоединение(Адрес, Защищенное = Истина) Экспорт
	
	Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("http://" + Адрес);
	
	ТаймаутСоединения = 10;
	
	Если Защищенное Тогда	
		ЗащищенноеСоединение = НовоеЗащищенноеСоединение(, Новый СертификатыУдостоверяющихЦентровОС);
		Соединение = Новый HTTPСоединение(Адрес, , , , Прокси, ТаймаутСоединения, ЗащищенноеСоединение);	
	Иначе
		Соединение = Новый HTTPСоединение(Адрес, , , , Прокси, ТаймаутСоединения);
	КонецЕсли;
	
	Возврат Соединение;
	
КонецФункции

Функция НовоеЗащищенноеСоединение(СертификатКлиента = Неопределено, СертификатыУдостоверяющихЦентров = Неопределено) Экспорт
	
	Возврат Новый ЗащищенноеСоединениеOpenSSL(СертификатКлиента, СертификатыУдостоверяющихЦентров);
	
КонецФункции

Функция ВыполнитьGETЗапрос(Адрес, Аккаунт, Категория = "") Экспорт
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		АдресЗапроса = "api-seller.ozon.ru";		
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Если Категория = "Контент" Тогда
			
			АдресЗапроса = "content-api.wildberries.ru";
			
		ИначеЕсли Категория = "Аналитика" Тогда
			
			АдресЗапроса = "seller-analytics-api.wildberries.ru";
			
		ИначеЕсли Категория = "Цены и скидки" Тогда
			
			АдресЗапроса = "discounts-prices-api.wildberries.ru";
			
		ИначеЕсли Категория = "Маркетплейс" Тогда
			
			АдресЗапроса = "marketplace-api.wildberries.ru";
			
		ИначеЕсли Категория = "Статистика" Тогда
			
			АдресЗапроса = "statistics-api.wildberries.ru";
			
		ИначеЕсли Категория = "Продвижение" Тогда
			
			АдресЗапроса = "advert-api.wildberries.ru";
			
		Иначе
			
			АдресЗапроса = "";	
			
		КонецЕсли;	
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		АдресЗапроса = "api.partner.market.yandex.ru";	
		
	КонецЕсли;
	
	HTTPСоединение 	= 	НовоеHTTPСоединение(АдресЗапроса);
	HTTPЗапрос		= 	HTTPЗапрос(Строка(Адрес), Аккаунт);
	
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	ОтветВВидеСтроки = Ответ.ПолучитьТелоКакСтроку();
	
	Попытка
		
		ОтветJSON = Новый ЧтениеJSON;
		ОтветJSON.УстановитьСтроку(ОтветВВидеСтроки); 
		
		ОбъектИзJSON = ПрочитатьJSON(ОтветJSON);
		ОтветJSON.Закрыть();
		
		ОтветныеДанные = Новый Структура;
		ОтветныеДанные.Вставить("ОтветAPI", ОбъектИзJSON);
		ОтветныеДанные.Вставить("КодСостояния", Ответ.КодСостояния); 
		ОтветныеДанные.Вставить("Заголовки", Ответ.Заголовки);
		ОтветныеДанные.Вставить("ОтветКакСтрока", ОтветВВидеСтроки);	
		
	Исключение
		
		ОтветныеДанные = Новый Структура;
		ОтветныеДанные.Вставить("КодСостояния", Ответ.КодСостояния); 
		ОтветныеДанные.Вставить("Заголовки", Ответ.Заголовки);
		
	КонецПопытки;
	
	
	Возврат ОтветныеДанные;
КонецФункции 

Функция ВыполнитьPOSTЗапрос(СтрокаJSON = "", Адрес, Аккаунт, Категория = "") Экспорт
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		АдресЗапроса = "api-seller.ozon.ru";		
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Если Категория = "Контент" Тогда
			
			АдресЗапроса = "content-api.wildberries.ru";
			
		ИначеЕсли Категория = "Аналитика" Тогда
			
			АдресЗапроса = "seller-analytics-api.wildberries.ru";
			
		ИначеЕсли Категория = "Цены и скидки" Тогда
			
			АдресЗапроса = "discounts-prices-api.wildberries.ru";
			
		ИначеЕсли Категория = "Маркетплейс" Тогда
			
			АдресЗапроса = "marketplace-api.wildberries.ru";
			
		ИначеЕсли Категория = "Статистика" Тогда
			
			АдресЗапроса = "statistics-api.wildberries.ru";
			
		ИначеЕсли Категория = "Продвижение" Тогда
			
			АдресЗапроса = "advert-api.wildberries.ru";
			
		Иначе
			
			АдресЗапроса = "";	
			
		КонецЕсли;	
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		АдресЗапроса = "api.partner.market.yandex.ru";	
		
	КонецЕсли;
	
	HTTPСоединение 	= 	НовоеHTTPСоединение(АдресЗапроса);
	HTTPЗапрос		= 	HTTPЗапрос(Строка(Адрес),Аккаунт);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
	Ответ 			 = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	ОтветВВидеСтроки = Ответ.ПолучитьТелоКакСтроку();
	
	Попытка
		
		ОтветJSON = Новый ЧтениеJSON;
		ОтветJSON.УстановитьСтроку(ОтветВВидеСтроки); 
		
		ОбъектИзJSON = ПрочитатьJSON(ОтветJSON);
		ОтветJSON.Закрыть();
		
		ОтветныеДанные = Новый Структура;
		ОтветныеДанные.Вставить("ОтветAPI", ОбъектИзJSON);
		ОтветныеДанные.Вставить("КодСостояния", Ответ.КодСостояния); 
		ОтветныеДанные.Вставить("Заголовки", Ответ.Заголовки);
		ОтветныеДанные.Вставить("ОтветКакСтрока", ОтветВВидеСтроки);	
		
	Исключение
		
		ОтветныеДанные = Новый Структура;
		ОтветныеДанные.Вставить("КодСостояния", Ответ.КодСостояния); 
		ОтветныеДанные.Вставить("Заголовки", Ответ.Заголовки);
		
	КонецПопытки;	
	
	
	Возврат ОтветныеДанные;  
	
КонецФункции

Функция ВыполнитьDELETEЗапрос(СтрокаJSON = "", Адрес, Аккаунт, Категория = "") Экспорт
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		АдресЗапроса = "api-seller.ozon.ru";		
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Если Категория = "Контент" Тогда
			
			АдресЗапроса = "content-api.wildberries.ru";
			
		ИначеЕсли Категория = "Аналитика" Тогда
			
			АдресЗапроса = "seller-analytics-api.wildberries.ru";
			
		ИначеЕсли Категория = "Цены и скидки" Тогда
			
			АдресЗапроса = "discounts-prices-api.wildberries.ru";
			
		ИначеЕсли Категория = "Маркетплейс" Тогда
			
			АдресЗапроса = "marketplace-api.wildberries.ru";
			
		ИначеЕсли Категория = "Статистика" Тогда
			
			АдресЗапроса = "statistics-api.wildberries.ru";
			
		ИначеЕсли Категория = "Продвижение" Тогда
			
			АдресЗапроса = "advert-api.wildberries.ru";
			
		Иначе
			
			АдресЗапроса = "";	
			
		КонецЕсли;	
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		АдресЗапроса = "api.partner.market.yandex.ru";	
		
	КонецЕсли;
	
	HTTPСоединение 	= 	НовоеHTTPСоединение(АдресЗапроса);
	HTTPЗапрос		= 	HTTPЗапрос(Строка(Адрес),Аккаунт);
	
	Если СтрокаJSON <> "" Тогда
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
	КонецЕсли;
	
	Ответ 			 = HTTPСоединение.Удалить(HTTPЗапрос);
	ОтветВВидеСтроки = Ответ.ПолучитьТелоКакСтроку();
	
	Попытка
		
		ОтветJSON = Новый ЧтениеJSON;
		ОтветJSON.УстановитьСтроку(ОтветВВидеСтроки); 
		
		ОбъектИзJSON = ПрочитатьJSON(ОтветJSON);
		ОтветJSON.Закрыть();
		
		ОтветныеДанные = Новый Структура;
		ОтветныеДанные.Вставить("ОтветAPI", ОбъектИзJSON);
		ОтветныеДанные.Вставить("КодСостояния", Ответ.КодСостояния); 
		ОтветныеДанные.Вставить("Заголовки", Ответ.Заголовки);
		ОтветныеДанные.Вставить("ОтветКакСтрока", ОтветВВидеСтроки);	
		
	Исключение
		
		ОтветныеДанные = Новый Структура;
		ОтветныеДанные.Вставить("КодСостояния", Ответ.КодСостояния); 
		ОтветныеДанные.Вставить("Заголовки", Ответ.Заголовки);
		
	КонецПопытки;
	
	Возврат ОтветныеДанные;  
	
КонецФункции  

Функция ВыполнитьPUTЗапрос(СтрокаJSON = "", Адрес, Аккаунт, Категория = "") Экспорт
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		АдресЗапроса = "api-seller.ozon.ru";		
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Если Категория = "Контент" Тогда
			
			АдресЗапроса = "content-api.wildberries.ru";
			
		ИначеЕсли Категория = "Аналитика" Тогда
			
			АдресЗапроса = "seller-analytics-api.wildberries.ru";
			
		ИначеЕсли Категория = "Цены и скидки" Тогда
			
			АдресЗапроса = "discounts-prices-api.wildberries.ru";
			
		ИначеЕсли Категория = "Маркетплейс" Тогда
			
			АдресЗапроса = "marketplace-api.wildberries.ru";
			
		ИначеЕсли Категория = "Статистика" Тогда
			
			АдресЗапроса = "statistics-api.wildberries.ru";
			
		ИначеЕсли Категория = "Продвижение" Тогда
			
			АдресЗапроса = "advert-api.wildberries.ru";
			
		Иначе
			
			АдресЗапроса = "";	
			
		КонецЕсли;	
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		АдресЗапроса = "api.partner.market.yandex.ru";	
		
	КонецЕсли;
	
	HTTPСоединение 	= 	НовоеHTTPСоединение(АдресЗапроса);
	HTTPЗапрос		= 	HTTPЗапрос(Строка(Адрес),Аккаунт);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
	Ответ 			 = HTTPСоединение.Записать(HTTPЗапрос);
	ОтветВВидеСтроки = Ответ.ПолучитьТелоКакСтроку();
	
	Попытка
		
		ОтветJSON = Новый ЧтениеJSON;
		ОтветJSON.УстановитьСтроку(ОтветВВидеСтроки); 
		
		ОбъектИзJSON = ПрочитатьJSON(ОтветJSON);
		ОтветJSON.Закрыть();
		
		ОтветныеДанные = Новый Структура;
		ОтветныеДанные.Вставить("ОтветAPI", ОбъектИзJSON);
		ОтветныеДанные.Вставить("КодСостояния", Ответ.КодСостояния); 
		ОтветныеДанные.Вставить("Заголовки", Ответ.Заголовки);
		ОтветныеДанные.Вставить("ОтветКакСтрока", ОтветВВидеСтроки);	
		
	Исключение
		
		ОтветныеДанные = Новый Структура;
		ОтветныеДанные.Вставить("КодСостояния", Ответ.КодСостояния); 
		ОтветныеДанные.Вставить("Заголовки", Ответ.Заголовки);
		
	КонецПопытки;	
	
	Возврат ОтветныеДанные;  
	
КонецФункции

Функция ВыполнитьPATCHЗапрос(Адрес, Аккаунт, Категория = "", СтрокаJSON = "")Экспорт
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		АдресЗапроса = "api-seller.ozon.ru";		
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Если Категория = "Контент" Тогда
			
			АдресЗапроса = "content-api.wildberries.ru";
			
		ИначеЕсли Категория = "Аналитика" Тогда
			
			АдресЗапроса = "seller-analytics-api.wildberries.ru";
			
		ИначеЕсли Категория = "Цены и скидки" Тогда
			
			АдресЗапроса = "discounts-prices-api.wildberries.ru";
			
		ИначеЕсли Категория = "Маркетплейс" Тогда
			
			АдресЗапроса = "marketplace-api.wildberries.ru";
			
		ИначеЕсли Категория = "Статистика" Тогда
			
			АдресЗапроса = "statistics-api.wildberries.ru";
			
		ИначеЕсли Категория = "Продвижение" Тогда
			
			АдресЗапроса = "advert-api.wildberries.ru";
			
		Иначе
			
			АдресЗапроса = "";	
			
		КонецЕсли;	
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		АдресЗапроса = "api.partner.market.yandex.ru";	
		
	КонецЕсли;
	
	HTTPСоединение 	= 	НовоеHTTPСоединение(АдресЗапроса);
	HTTPЗапрос		= 	HTTPЗапрос(Строка(Адрес), Аккаунт);
	
	Если СтрокаJSON <> "" Тогда
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
	КонецЕсли;
	
	Ответ 			 = HTTPСоединение.Изменить(HTTPЗапрос);
	ОтветВВидеСтроки = Ответ.ПолучитьТелоКакСтроку();
	
	Попытка
		
		ОтветJSON = Новый ЧтениеJSON;
		ОтветJSON.УстановитьСтроку(ОтветВВидеСтроки); 
		
		ОбъектИзJSON = ПрочитатьJSON(ОтветJSON);
		ОтветJSON.Закрыть();
		
		ОтветныеДанные = Новый Структура;
		ОтветныеДанные.Вставить("ОтветAPI", ОбъектИзJSON);
		ОтветныеДанные.Вставить("КодСостояния", Ответ.КодСостояния); 
		ОтветныеДанные.Вставить("Заголовки", Ответ.Заголовки);
		ОтветныеДанные.Вставить("ОтветКакСтрока", ОтветВВидеСтроки);	
		
	Исключение
		
		ОтветныеДанные = Новый Структура;
		ОтветныеДанные.Вставить("КодСостояния", Ответ.КодСостояния); 
		ОтветныеДанные.Вставить("Заголовки", Ответ.Заголовки);
		
	КонецПопытки;
	
	Возврат ОтветныеДанные;	
	
КонецФункции

Функция ВыполнитьPOSTЗапросДляPDF(СтрокаJSON = "", Адрес, Аккаунт, Категория = "") Экспорт
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		АдресЗапроса = "api-seller.ozon.ru";		
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Если Категория = "Контент" Тогда
			
			АдресЗапроса = "content-api.wildberries.ru";
			
		ИначеЕсли Категория = "Аналитика" Тогда
			
			АдресЗапроса = "seller-analytics-api.wildberries.ru";
			
		ИначеЕсли Категория = "Цены и скидки" Тогда
			
			АдресЗапроса = "discounts-prices-api.wildberries.ru";
			
		ИначеЕсли Категория = "Маркетплейс" Тогда
			
			АдресЗапроса = "marketplace-api.wildberries.ru";
			
		ИначеЕсли Категория = "Статистика" Тогда
			
			АдресЗапроса = "statistics-api.wildberries.ru";
			
		ИначеЕсли Категория = "Продвижение" Тогда
			
			АдресЗапроса = "advert-api.wildberries.ru";
			
		Иначе
			
			АдресЗапроса = "";	
			
		КонецЕсли;	
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		АдресЗапроса = "api.partner.market.yandex.ru";	
		
	КонецЕсли;
	
	HTTPСоединение 	= 	НовоеHTTPСоединение(АдресЗапроса);
	HTTPЗапрос		= 	HTTPЗапрос(Строка(Адрес),Аккаунт);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);  
	
	ОтветныеДанные = Новый Структура;
	
	Если Константы.рар_мп_МестоХраненияФайлов.Получить() = "" Тогда
		
		ОтветныеДанные.Вставить("УказаноМестоХраненияФайлов", Ложь);
		Возврат ОтветныеДанные; 
		
	Иначе
		
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос, СтрШаблон("%1\Лист отгрузки от %2.pdf", Константы.рар_мп_МестоХраненияФайлов.Получить(), Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy")));
		
		Если Ответ.КодСостояния <> 200 Тогда
			
			ОтветВВидеСтроки = Ответ.ПолучитьТелоКакСтроку();
			
			Попытка
				
				ОтветJSON = Новый ЧтениеJSON;
				ОтветJSON.УстановитьСтроку(ОтветВВидеСтроки); 
				
				ОбъектИзJSON = ПрочитатьJSON(ОтветJSON);
				ОтветJSON.Закрыть();
				
				ОтветныеДанные.Вставить("ОтветAPI", ОбъектИзJSON);
				ОтветныеДанные.Вставить("КодСостояния", Ответ.КодСостояния); 
				ОтветныеДанные.Вставить("Заголовки", Ответ.Заголовки);
				ОтветныеДанные.Вставить("ОтветКакСтрока", ОтветВВидеСтроки);	
				
			Исключение
				
				ОтветныеДанные.Вставить("КодСостояния", Ответ.КодСостояния); 
				ОтветныеДанные.Вставить("Заголовки", Ответ.Заголовки);
				
			КонецПопытки;	
						
		КонецЕсли;
		
		ОтветныеДанные.Вставить("КодСостояния", Ответ.КодСостояния);
		ОтветныеДанные.Вставить("Заголовки", Ответ.Заголовки);
		ОтветныеДанные.Вставить("УказаноМестоХраненияФайлов", Истина);  
		
		Возврат ОтветныеДанные;        
		
	КонецЕсли;
	
	
КонецФункции

Функция ВыполнитьPOSTЗапросДляДвоичныхДанных(СтрокаJSON = "", Адрес, Аккаунт, Категория = "") Экспорт
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		АдресЗапроса = "api-seller.ozon.ru";		
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Если Категория = "Контент" Тогда
			
			АдресЗапроса = "content-api.wildberries.ru";
			
		ИначеЕсли Категория = "Аналитика" Тогда
			
			АдресЗапроса = "seller-analytics-api.wildberries.ru";
			
		ИначеЕсли Категория = "Цены и скидки" Тогда
			
			АдресЗапроса = "discounts-prices-api.wildberries.ru";
			
		ИначеЕсли Категория = "Маркетплейс" Тогда
			
			АдресЗапроса = "marketplace-api.wildberries.ru";
			
		ИначеЕсли Категория = "Статистика" Тогда
			
			АдресЗапроса = "statistics-api.wildberries.ru";
			
		ИначеЕсли Категория = "Продвижение" Тогда
			
			АдресЗапроса = "advert-api.wildberries.ru";
			
		Иначе
			
			АдресЗапроса = "";	
			
		КонецЕсли;	
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		АдресЗапроса = "api.partner.market.yandex.ru";	
		
	КонецЕсли;
	
	HTTPСоединение 	= 	НовоеHTTPСоединение(АдресЗапроса);
	HTTPЗапрос		= 	HTTPЗапрос(Строка(Адрес),Аккаунт);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
	Ответ 			 			= HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	ОтветВВидеДвоичныхДанных 	= Ответ.ПолучитьТелоКакДвоичныеДанные();
	
	Попытка
		
		ОтветныеДанные = Новый Структура;
		ОтветныеДанные.Вставить("КодСостояния", Ответ.КодСостояния); 
		ОтветныеДанные.Вставить("Заголовки", Ответ.Заголовки);
		ОтветныеДанные.Вставить("ОтветКакДвоичныеДанные", ОтветВВидеДвоичныхДанных);	
		
	Исключение
		
		ОтветныеДанные = Новый Структура;
		ОтветныеДанные.Вставить("КодСостояния", Ответ.КодСостояния); 
		ОтветныеДанные.Вставить("Заголовки", Ответ.Заголовки);
		
	КонецПопытки;	
	
	Возврат ОтветныеДанные; 
	
КонецФункции
